<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"9c93eb23300dc0e125c887e997501a0319d0f1abc6a5e444885a66fb2012ec13","plan_job_ref":"Job Terraform CI-CD pipeline #27 at https://github.com/HasanAshab/go-web-app-infra/actions/runs/15800931820","plan_out_hash":"14f4b9be2478b68dfe0346cd6219a71866a00be0fe0d4973914cc1a5b8e2c3a7","plan_hash":"161788e84020efcabd5d267901482bdaebf31971d6fc07586cec4c6a8540850b","plan_text_format":"diff","version":"2.1.0","closed":true} -->
Terraform plan in __.__ in the __prod__ workspace
With var files: `prod.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.main will be created
+   resource "azurerm_kubernetes_cluster" "main" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "aksprodeastus001"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "eastus"
+       name                                = "aks-prod-eastus-001"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "rg-go-web-app-prod"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment" = "prod"
+           "Service"     = "aks"
        }
+       workload_identity_enabled           = false

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 1
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       windows_profile (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform CI-CD pipeline #28](https://github.com/HasanAshab/go-web-app-infra/actions/runs/15800943156)
<details open><summary>Outputs</summary>

```hcl
kube_config_command = "az aks get-credentials --resource-group rg-go-web-app-prod --name aks-prod-eastus-001"
```
</details>